; ModuleID = 'three_fry_linked'
source_filename = "three_fry_linked"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64-unknown-unknown-eabi-elf"

%iree_hal_executable_library_header_t = type { i32, ptr, i32, i32 }
%iree_hal_executable_dispatch_attrs_v0_t = type { i16, i8, i8, i32, i64, i64, i64, i64, i64, i64, i64, i64 }
%iree_hal_executable_source_location_v0_t = type { i32, i32, ptr }
%iree_hal_executable_stage_location_table_v0_t = type { i32, ptr, ptr }
%iree_hal_executable_library_v0_t = type { ptr, %iree_hal_executable_import_table_v0_t, %iree_hal_executable_export_table_v0_t, %iree_hal_executable_constant_table_v0_t, %iree_hal_executable_source_file_table_v0_t }
%iree_hal_executable_import_table_v0_t = type { i32, ptr }
%iree_hal_executable_export_table_v0_t = type { i32, ptr, ptr, ptr, ptr, ptr, ptr }
%iree_hal_executable_constant_table_v0_t = type { i32 }
%iree_hal_executable_source_file_table_v0_t = type { i32, ptr }
%struct.powf_log2_data = type { [16 x %struct.anon], [5 x double] }
%struct.anon = type { double, double }
%struct.exp2f_data = type { [32 x i64], double, [3 x double], double, double, [3 x double] }

@0 = internal constant [17 x i8] c"three_fry_linked\00", align 1
@iree_hal_executable_library_query_v0_header = internal constant %iree_hal_executable_library_header_t { i32 5, ptr @0, i32 0, i32 0 }

!0 = !{i32 2, !"Debug Info Version", i32 3}
!1 = !{i32 1, !"wchar_size", i32 4}
!2 = distinct !DICompileUnit(language: DW_LANG_C17, file: !3, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!3 = !DIFile(filename: "three_fry.mlir", directory: "/home/mahesh/iree/iree/tests/e2e/stablehlo_ops")
!4 = distinct !DICompileUnit(language: DW_LANG_C17, file: !3, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!5 = distinct !DICompileUnit(language: DW_LANG_C17, file: !3, producer: "IREE", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug)
!6 = distinct !DISubprogram(name: "_three_fry_i32_dispatch_0_elementwise_broadcast_4_i32", linkageName: "_three_fry_i32_dispatch_0_elementwise_broadcast_4_i32", scope: !3, file: !3, line: 1, type: !7, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2)
!7 = !DISubroutineType(cc: DW_CC_normal, types: !8)
!8 = !{!9, !10, !41, !70}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_environment_v0_t", baseType: !13)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_environment_v0_t", scope: !14, file: !14, line: 246, size: 768, elements: !15)
!14 = !DIFile(filename: "runtime/src/iree/hal/local/executable_library.h", directory: ".")
!15 = !{!16, !24, !27, !30, !32}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DICompositeType(tag: DW_TAG_array_type, scope: !14, file: !14, line: 227, baseType: !20, size: 2048, elements: !22)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", baseType: !21)
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !{!23}
!23 = !DISubrange(count: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "import_thunk", baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = !DIBasicType(name: "void", encoding: DW_ATE_address)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "import_funcs", baseType: !28, size: 64, offset: 128)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "import_contexts", baseType: !31, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "processor", baseType: !33, offset: 256)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_processor_v0_t", scope: !14, file: !14, line: 227, size: 512, elements: !34)
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "data", baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_array_type, scope: !14, file: !14, line: 227, baseType: !37, size: 512, elements: !39)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", baseType: !38)
!38 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !{!40}
!40 = !DISubrange(count: 8)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_dispatch_state_v0_t", baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_dispatch_state_v0_t", scope: !14, file: !14, line: 275, size: 384, elements: !45)
!45 = !{!46, !47, !48, !51, !52, !53, !54, !55, !58, !59, !60, !65}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_x", baseType: !20, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_y", baseType: !20, size: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_size_z", baseType: !49, size: 16, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", baseType: !50)
!50 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "constant_count", baseType: !49, size: 16, offset: 80)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_x", baseType: !20, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_y", baseType: !20, size: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_count_z", baseType: !49, size: 16, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "max_concurrency", baseType: !56, size: 8, offset: 176)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", baseType: !57)
!57 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "binding_count", baseType: !56, size: 8, offset: 184)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "constants", baseType: !17, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "binding_ptrs", baseType: !61, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, scope: !14, file: !14, line: 227, baseType: !64, size: 4096, elements: !22)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "binding_lengths", baseType: !66, size: 64, offset: 320)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_array_type, scope: !14, file: !14, line: 227, baseType: !69, size: 4096, elements: !22)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", baseType: !37)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "iree_hal_executable_workgroup_state_v0_t", baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iree_hal_executable_workgroup_state_v0_t", scope: !14, file: !14, line: 321, size: 256, elements: !74)
!74 = !{!75, !76, !77, !78, !79, !80, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_x", baseType: !20, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_y", baseType: !20, size: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "workgroup_id_z", baseType: !49, size: 16, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", baseType: !49, size: 16, offset: 80)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "processor_id", baseType: !20, size: 32, offset: 96)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory", baseType: !25, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "local_memory_size", baseType: !20, size: 32, offset: 192)
!82 = !DILocation(line: 2, column: 10, scope: !6)
!83 = !DILocation(line: 3, column: 10, scope: !6)
!84 = distinct !DISubprogram(name: "_three_fry_i32_dispatch_1_slow_memcpy", linkageName: "_three_fry_i32_dispatch_1_slow_memcpy", scope: !3, file: !3, line: 1, type: !7, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !4)
!85 = !DILocation(line: 3, column: 10, scope: !84)
!86 = distinct !DISubprogram(name: "_three_fry_i32_dispatch_2_slow_memcpy", linkageName: "_three_fry_i32_dispatch_2_slow_memcpy", scope: !3, file: !3, line: 1, type: !7, scopeLine: 1, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !5)
!87 = !DILocation(line: 3, column: 10, scope: !86)
!88 = !{!89, !89, i64 0}
!89 = !{!"short", !90, i64 0}
!90 = !{!"omnipotent char", !91, i64 0}
!91 = !{!"Simple C/C++ TBAA"}
!92 = !{!93, !93, i64 0}
!93 = !{!"float", !90, i64 0}
!94 = !{!"branch_weights", i32 2000, i32 1}
!95 = !{!96, !96, i64 0}
!96 = !{!"long", !90, i64 0}
!97 = !{!"branch_weights", i32 4001, i32 4000000}
!98 = !{!99, !100, i64 0}
!99 = !{!"", !100, i64 0, !100, i64 8}
!100 = !{!"double", !90, i64 0}
!101 = !{!99, !100, i64 8}
!102 = !{!"branch_weights", i32 1, i32 2000}
